Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_16 (LSTM)               (None, None, 8)           320       
_________________________________________________________________
lstm_17 (LSTM)               (None, 4)                 208       
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 5         
=================================================================
Total params: 533
Trainable params: 533
Non-trainable params: 0
_________________________________________________________________