Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_18 (LSTM)               (None, None, 8)           320       
_________________________________________________________________
lstm_19 (LSTM)               (None, 4)                 208       
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 5         
=================================================================
Total params: 533
Trainable params: 533
Non-trainable params: 0
_________________________________________________________________