Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_12 (LSTM)               (None, None, 8)           320       
_________________________________________________________________
lstm_13 (LSTM)               (None, 4)                 208       
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 5         
=================================================================
Total params: 533
Trainable params: 533
Non-trainable params: 0
_________________________________________________________________